Enums/ДоступныеПериодыОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ДоступныеПериодыОтчета</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаНеделю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаДекаду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаКвартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПолугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ВыборПроизвольногоПериода/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   = НСтр(" ru = ""Январь""");
	СтрокаПериода.Квартал = НСтр(" ru = ""I квартал""");
	СтрокаПериода.БольшеКвартала = НСтр(" ru = ""I Полугодие""");
		
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   = НСтр(" ru = ""Февраль""");
	СтрокаПериода.Квартал = НСтр(" ru = ""II квартал""");
	СтрокаПериода.БольшеКвартала = НСтр(" ru = ""II Полугодие""");
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   = НСтр(" ru = ""Март""");
	СтрокаПериода.Квартал = НСтр(" ru = ""III квартал""");
	СтрокаПериода.БольшеКвартала = НСтр(" ru = ""9 месяцев""");
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   =  НСтр(" ru = ""Апрель""");
	СтрокаПериода.Квартал = НСтр(" ru = ""IV квартал""");
	СтрокаПериода.БольшеКвартала = НСтр(" ru = ""Год""");
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   = НСтр(" ru = ""Май""");
	СтрокаПериода.Квартал = НСтр(" ru = ""Произвольный период""");
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   = НСтр(" ru = ""Июнь""");
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   = НСтр(" ru = ""Июль""");
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   = НСтр(" ru = ""Август""");
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   = НСтр(" ru = ""Сентябрь""");
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   = НСтр(" ru = ""Октябрь""");
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();      
	СтрокаПериода.Месяц   = НСтр(" ru = ""Ноябрь""");
	
	СтрокаПериода = ТаблицаНачалаПериода.Добавить();
	СтрокаПериода.Месяц   = НСтр(" ru = ""Декабрь""");
	
	ПеречисленияПериодов = Новый Структура("ЗаГод, ЗаПолугодие, ЗаКвартал, ЗаМесяц, ЗаДекаду, ЗаНеделю, ЗаДень, ЗаПроизвольныйПериод");
	
	ПеречисленияПериодов.ЗаГод                = Перечисления.ДоступныеПериодыОтчета.ЗаГод;
	ПеречисленияПериодов.ЗаПолугодие          = Перечисления.ДоступныеПериодыОтчета.ЗаПолугодие;
	ПеречисленияПериодов.ЗаКвартал            = Перечисления.ДоступныеПериодыОтчета.ЗаКвартал;
	ПеречисленияПериодов.ЗаМесяц              = Перечисления.ДоступныеПериодыОтчета.ЗаМесяц;
	ПеречисленияПериодов.ЗаДекаду             = Перечисления.ДоступныеПериодыОтчета.ЗаДекаду;
	ПеречисленияПериодов.ЗаНеделю             = Перечисления.ДоступныеПериодыОтчета.ЗаНеделю;
	ПеречисленияПериодов.ЗаДень               = Перечисления.ДоступныеПериодыОтчета.ЗаДень;
	ПеречисленияПериодов.ЗаПроизвольныйПериод = Перечисления.ДоступныеПериодыОтчета.ПроизвольныйПериод;
	
	Если Параметры.НачалоПериода = '00010101' и Параметры.КонецПериода = '00010101' тогда
		НачалоПериода = ФункцииОтчетовКлиентСервер.НачалоПериодаОтчета(Параметры.МинимальныйПериод, ТекущаяДатаСеанса(), ПеречисленияПериодов);
		КонецПериода  = ФункцииОтчетовКлиентСервер.КонецПериодаОтчета(Параметры.МинимальныйПериод, ТекущаяДатаСеанса(), ПеречисленияПериодов);
	Иначе
		НачалоПериода = Параметры.НачалоПериода;
		КонецПериода  = Параметры.КонецПериода;
	КонецЕсли;

	ВидПериода = ФункцииОтчетовКлиентСервер.ПолучитьВидПериода(НачалоПериода, КонецПериода, ПеречисленияПериодов);
	
	Если (ВидПериода = Перечисления.ДоступныеПериодыОтчета.ПроизвольныйПериод и 
		НачалоПериода <> НачалоГода(НачалоПериода) и КонецДня(КонецПериода) <> КонецМесяца(ДобавитьМесяц(НачалоГода(НачалоПериода),8)))
	 или ВидПериода = Перечисления.ДоступныеПериодыОтчета.ЗаДень 
	 или ВидПериода = Перечисления.ДоступныеПериодыОтчета.ЗаДекаду 
	 или ВидПериода = Перечисления.ДоступныеПериодыОтчета.ЗаНеделю 
	 тогда
	 
	 	ТекЭлемент = Элементы.ТаблицаКвартал.Имя;
		ИндексСтроки   = 4;
		
	ИначеЕсли ВидПериода = Перечисления.ДоступныеПериодыОтчета.ЗаМесяц тогда
		
		ТекЭлемент = Элементы.ТаблицаМесяц.Имя;
		ИндексСтроки = Месяц(НачалоПериода)-1;
		
	ИначеЕсли ВидПериода = Перечисления.ДоступныеПериодыОтчета.ЗаКвартал тогда
		
		ТекЭлемент = Элементы.ТаблицаКвартал.Имя;
		ИндексСтроки = Окр((Месяц(НачалоПериода))/4);
		
	ИначеЕсли ВидПериода = Перечисления.ДоступныеПериодыОтчета.ЗаПолугодие тогда
		
		ТекЭлемент = Элементы.ТаблицаБольшеКвартала.Имя;
		ИндексСтроки = Окр((Месяц(НачалоПериода)-1)/6);
		
	ИначеЕсли (ВидПериода = Перечисления.ДоступныеПериодыОтчета.ПроизвольныйПериод 
			и НачалоПериода = НачалоГода(НачалоПериода) и КонецДня(КонецПериода) = КонецМесяца(ДобавитьМесяц(НачалоГода(НачалоПериода),8))) тогда
			
		ТекЭлемент = Элементы.ТаблицаБольшеКвартала.Имя;
		ИндексСтроки = 2;
		
	ИначеЕсли ВидПериода = Перечисления.ДоступныеПериодыОтчета.ЗаГод тогда 
		
		ТекЭлемент = Элементы.ТаблицаБольшеКвартала.Имя;
		ИндексСтроки = 3;
	КонецЕсли;
	
	Элементы.ПереключательГодаНачала.СписокВыбора.Очистить();
	
	ГодНачала    = Год(НачалоПериода);
	
	Для Сч = ГодНачала-2 по ГодНачала+2 Цикл
		Элементы.ПереключательГодаНачала.СписокВыбора.Добавить(Сч, Формат(Сч, "ЧГ=0"));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)

	Если НачалоПериода > КонецПериода тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр(" ru = ""Дата начала периода больше чем дата окончания периода"""), , "НачалоПериода");
		Возврат
	КонецЕсли;
	                           
	Данные = Новый Структура("НачалоПериода, КонецПериода", НачалоПериода, КонецПериода);
	Закрыть(Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНачалаГодНазад(Команда)
	Для каждого ЭлементСписка из Элементы.ПереключательГодаНачала.СписокВыбора Цикл
		ЭлементСписка.Значение = ЭлементСписка.Значение - 1;
		ЭлементСписка.Представление = Формат(ЭлементСписка.Значение, "ЧГ=0")
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СписокНачалаГодВперед(Команда)
	Для каждого ЭлементСписка из Элементы.ПереключательГодаНачала.СписокВыбора Цикл
		ЭлементСписка.Значение = ЭлементСписка.Значение + 1;
		ЭлементСписка.Представление = Формат(ЭлементСписка.Значение, "ЧГ=0")
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ТаблицаНачала.ТекущаяСтрока = ИндексСтроки;
	
	Если ТекЭлемент = "ТаблицаКвартал" тогда
		Элементы.ТаблицаНачала.ТекущийЭлемент = Элементы.ТаблицаКвартал;
	ИначеЕсли ТекЭлемент = "ТаблицаМесяц" тогда
		Элементы.ТаблицаНачала.ТекущийЭлемент = Элементы.ТаблицаМесяц;
	ИначеЕсли ТекЭлемент = "ТаблицаБольшеКвартала" тогда
		Элементы.ТаблицаНачала.ТекущийЭлемент = Элементы.ТаблицаБольшеКвартала;
	КонецЕсли;
	
	ТекЭлемент = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНачалаПриАктивизацииЯчейки(Элемент)
	
	Если ТекЭлемент <> "" тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаКвартал" тогда
		Если Элемент.ТекущиеДанные.Квартал = НСтр(" ru = ""IV квартал""") тогда
			НачалоПериода = Дата(ГодНачала, 10, 1);
			КонецПериода = КонецКвартала(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Квартал = НСтр(" ru = ""III квартал""") тогда
			НачалоПериода = Дата(ГодНачала, 7, 1);
			КонецПериода = КонецКвартала(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Квартал = НСтр(" ru = ""II квартал""") тогда
			НачалоПериода = Дата(ГодНачала, 4, 1);
			КонецПериода = КонецКвартала(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Квартал = НСтр(" ru = ""I квартал""") тогда
			НачалоПериода = Дата(ГодНачала, 1, 1);
			КонецПериода = КонецКвартала(НачалоПериода);
		КонецЕсли;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТаблицаМесяц" тогда
		Если Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Январь""") тогда
			НачалоПериода = Дата(ГодНачала, 1, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Февраль""") тогда
			НачалоПериода = Дата(ГодНачала, 2, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Март""") тогда
			НачалоПериода = Дата(ГодНачала, 3, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Апрель""") тогда
			НачалоПериода = Дата(ГодНачала, 4, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Май""") тогда
			НачалоПериода = Дата(ГодНачала, 5, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Июнь""") тогда
			НачалоПериода = Дата(ГодНачала, 6, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Июль""") тогда
			НачалоПериода = Дата(ГодНачала, 7, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Август""") тогда
			НачалоПериода = Дата(ГодНачала, 8, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Сентябрь""") тогда
			НачалоПериода = Дата(ГодНачала, 9, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Октябрь""") тогда
			НачалоПериода = Дата(ГодНачала, 10, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Ноябрь""") тогда
			НачалоПериода = Дата(ГодНачала, 11, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		ИначеЕсли Элемент.ТекущиеДанные.Месяц = НСтр(" ru = ""Декабрь""") тогда
			НачалоПериода = Дата(ГодНачала, 12, 1);
			КонецПериода  = КонецМесяца(НачалоПериода);
		КонецЕсли;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТаблицаБольшеКвартала" тогда
		Если Элемент.ТекущиеДанные.БольшеКвартала = НСтр(" ru = ""I Полугодие""") тогда
			НачалоПериода = Дата(ГодНачала, 1, 1);
			КонецПериода  = КонецМесяца(Дата(ГодНачала, 6, 1));
		ИначеЕсли Элемент.ТекущиеДанные.БольшеКвартала = НСтр(" ru = ""II Полугодие""") тогда
			НачалоПериода = Дата(ГодНачала, 7, 1);
			КонецПериода  = КонецМесяца(Дата(ГодНачала, 12, 1));
		ИначеЕсли Элемент.ТекущиеДанные.БольшеКвартала = НСтр(" ru = ""9 месяцев""") тогда
			НачалоПериода = Дата(ГодНачала, 1, 1);
			КонецПериода  = КонецМесяца(Дата(ГодНачала, 9, 1));
		ИначеЕсли Элемент.ТекущиеДанные.БольшеКвартала = НСтр(" ru = ""Год""") тогда
			НачалоПериода = Дата(ГодНачала, 1, 1);
			КонецПериода  = КонецГода(Дата(ГодНачала, 9, 1));
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПереключательГодаНачалаПриИзменении(Элемент)
	ТаблицаНачалаПриАктивизацииЯчейки(Элементы.ТаблицаНачала);
КонецПроцедуры
